// Задача 24: Напишите программу, которая 
// принимает на вход число (А) и выдаёт сумму чисел 
// от 1 до А.

int Read_Data (string numb)
Console.WriteLine("Введите число: ");
int numb = int.Parse(Console.ReadLine()??"0");